Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: This way you can also move objects between scraps.
ru_ru: Таким образом вы также можете перемещать объекты между скрапами.

source: This will extend all stations from station 5 to the left.
ru_ru: Это команда будет разворачивать все станции со станции 5 влево.

source: This will reset the declination definition.
ru_ru: Это приведет к сбросу склонения.

source: This window is a simplified outline of the text file, which will be saved by XTherion.
ru_ru: Это окно представляет собой упрощенный вывод текстового файла, который будет сохранен XTherion'ом.

source: Thus there is a special GUI for Therion called XTherion.
ru_ru: Поэтому существует специальный графический интерфейс для Therion'а,\break называемый XTherion.

source: To be improved.)
ru_ru: Будет улучшен).

source: To compile Loch, you need
ru_ru: Для компиляции Loch вам необходимы:

source: To control process of extended elevation, there is a special |extend| option in centerline command.
ru_ru: Чтобы контролировать процесс развертки существует специальная опция |extend| команды centerline.

source: To create a unique namespace the |centreline| command is enclosed in |survey| ... |endsurvey| command.
ru_ru: Чтобы создать уникальное пространство имен команда |centreline| заключена в команду |survey| ... |endsurvey|.

source: To display altitude on the passage wall, use |altitude| option for any line point of the passage wall], |height|Height of formations inside of the passage (like pit etc.); see below for details.], |passage-height|Height of the passage; see below for details.], |station-name|If no text is specified, the name of the nearest station is used.], -100 |date|;
ru_ru: Чтобы отобразить высоту на стене прохода, используйте опцию |altitude| для любой точки линии стены хода.] (высотная\break отметка), |height|Высота внутри хода (например, яма и т.д.); смотрите ниже подробнее.] (высота уступа/камина/колодца), |passage-height|Высота хода; смотрите ниже.]\break (высота хода), |station-name| Если текст не указан, используется имя ближайшей станции.] (имя станции, номер пикета), -100 |date| (дата\break наблюдения);

source: To display map { m2} in offset you need to create a map containing { m2} and specify offset and preview type for { m2} in this map.
ru_ru: Чтобы отобразить карту { m2} в смещении, вам нужно создать карту,\break содержащую { m2}, и указать тип смещения и предварительного просмотра для { m2} на этой карте.

source: To display them correctly you need to define symbols for them in {} languge the same way as ordinary symbols are usually redefined.
ru_ru: Чтобы правильно отображать их, вам необходимо определить символы для них в {}, как обычные символы обычно переопределяются.

source: To draw such a line all you need to do is to create a simple scrap with this line.
ru_ru: Чтобы нарисовать такую линию, вам нужно всего лишь создать простой скрап с этой линией.

source: To escape from `insert' to `select' mode, press { Esc} key on the keyboard or { Select} button in the { File commands} menu.
ru_ru: Чтобы выйти из режима `вставить', нажмите клавишу { Esc} на клавиатуре или кнопку { Выбрать} в меню { Команды в файле}.

source: To find number of your system, see |extern/proj4/nad/epsg| file in the therion source distribution.
ru_ru: Чтобы найти номер вашей системы, смотрите файл\break |extern/proj4/nad/epsg| в дистрибутиве исходников.

source: To keep data well organized, we have some naming conventions: in the file |foo.th2| all scraps are named |foo_si|, where |i| is |1|, |2| an so on.
ru_ru: Чтобы данные были хорошо организованы, мы приняли несколько соглашений об именах файлов: в файле |foo.th2| все скрапы\break именуются |foo_si|, где |i| -- |1|, |2| и так далее.

source: To make entering data easy, it supports table formatting of centreline data.
ru_ru: Чтобы упростить ввод данных, он поддерживает форматирование таблиц нитки хода.

source: To run Therion it's enough to open a configuration file and press `F9' or `Compile' button.
ru_ru: Для запуска Therion'а достаточно открыть конфигурационный файл и нажать кнопку `F9' или `Компилировать'.

source: To solve this problem, we need to re-import stations from top-level cave.3d file once more with |-surveys create| switch.
ru_ru: Чтобы решить эту проблему, нам нужно снова импортировать станции из файла cave.3d верхнего уровня с |-surveys create|.

source: To specify this, use
ru_ru: Чтобы сделать это, используйте

source: TrueType and OpenType fonts are supported.
ru_ru: Поддерживаются шрифты TrueType и OpenType.

source: Unfortunately, as a limitation of Tcl/Tk language, only GIF, PNM and PPM (plus PNG and JPEG if you installed tkImg extension) images are supported.
ru_ru: К сожалению, из-за ограничений языка Tcl/Tk,\break поддерживаются только изображения в форматах GIF, PNM и PPM (плюс PNG и JPEG, если вы установили расширение tkImg).

source: Units can follow the value.
ru_ru: За значением можно указать единицы измерения.

source: Unselects objects from export.
ru_ru: Отменяет выбор объектов для экспорта.

source: Usage example:
ru_ru: Пример использования:

source: Use `|/|' to separate first name and surname if there are more names.
ru_ru: Используйте `|/|' чтобы отделить имя и фамилию, если есть несколько имен.

source: Use the revise command if you want to add maps from higher levels to the preview.
ru_ru: Используйте команду |revise|, если вы хотите добавить карты с более\break высоких уровней для отображения.

source: Use with caution.
ru_ru: Используйте с\break осторожностью.

source: Use |-outline in| for large pillars etc. * |reverse <on/off>| = whether points are given in reverse order.
ru_ru: Использовать |-outline in| для больших колонн и т.п. * |reverse <on/off>| = точки указаны в обратном порядке.

source: Use |flag:<entrance/continuation/sink/spring/doline/dig>| as a |<symbol-type>| to hide stations with particular flags (e.g. |symbol-hide point flag:entrance|).
ru_ru: Используйте |flag:<entrance/continuation/sink/spring/doline/dig>| как |<тип символа>| чтобы скрыть станции с определенными флагами (например, |symbol-hide point flag:entrance|).

source: Used mostly for system-wide grades and layout definitions.
ru_ru: Используется в основном для system-wide grades и определений макетов;

source: Useful if there is other distribution installed on your system which had set-up any environment variables, which could confuse and programs supplied in Therion for Windows distribution.
ru_ru: Полезно, если в вашей системе установлен другой дистрибутив , который настроил переменные среды, которые могут запутать программы и , поставляемые с дистрибутивом Therion для Windows.

source: User may also benefit from comprehensive reference to the { METAFONT} language, which is quite similar to :
ru_ru: Пользователь также может воспользоваться исчерпывающей ссылкой на\break язык { METAFONT}, который очень похож на :

source: User may comfortably select a survey or map for export by double clicking on some of the items in the tree.
ru_ru: Пользователь может с комфортом выбрать съемку или карту для экспорта, дважды щелкнув некоторые элементы в дереве структуры.

source: Using other plain macros or primitives it's possible to add other features, e.g. a different layout for odd and even pages; headers and footers; or adding a logo to each page.
ru_ru: Используя другие plain макросы или примитивы , можно добавить другие функции, например другой макет для нечетных и четных страниц, заголовки и колонтитулы или добавить логотип на каждую страницу.

source: Using this option you can change any default therion text translation in output.
ru_ru: С помощью этой опции вы можете изменить любой текст перевода по умолчанию на выходе.

source: Using this scrap you receive the final map:
ru_ru: Используя этот скрап, вы\break получаете окончательную карту:

source: Using this you can change some layout properties directly within the export command.
ru_ru: Используя это, вы можете изменить некоторые свойства макета непосредственно в команде |export|.

source: Using too large scraps may exhaust 's memory if passage fills are frequently used and the map editor in XTherion is much less responsive when editing huge scraps.] Each scrap is processed separately by ; scraps which are too large may exceed 's memory and cause errors.
ru_ru: Слишком большие скрапы могут исчерпать память , если часто используются заливки хода. Кроме того, редактор карт в XTherion'е медленнее реагирует при редактировании\break больших скрапов.]. Каждый скрап\break обрабатывается отдельно ; слишком большие скрапы могут\break превысить размер памяти \ и вызвать ошибки.

source: Using |export continuation-list| you get an overview of all points in the centreline and scraps marked using |station| attribute for centreline point and |point continuation| in scraps] as a possible continuation.
ru_ru: Использование |export continuation-list| вы получите список всех точек в нитке хода и скрапах, отмеченных Используя атрибут |station| для точки нитки хода и |point continuation| в скрапах.] как продолжение (возможное продолжение).

source: Usually some level of this hierarchical structure survey represents caves, higher levels karst areas and lower levels e.g. passages.
ru_ru: Обычный уровень иерархической структуры survey представлен пещерами, более высокие уровни карстовыми областями, а более низкие уровни, например, ходами пещеры.

source: Usually there does not exist one-to-one mapping between them.
ru_ru: Обычно между ними не существует взаимно однозначного отображения.

source: Usually this is done from the command line in the data directory by typing
ru_ru: Обычно это делается из командной строки в каталоге данных путем ввода

source: V {Using user defined symbol types}.
ru_ru: V {Использование пользовательских типов символов}.

source: Value range is 0--100.
ru_ru: Диапазон значений 0-100.

source: Vasily V. Suhachev, Andrey Kozhenkov sk
ru_ru: {\font\tt=fhar6a \tt Василий Сухачев, Андрей Коженков} sk

source: Visually there is no difference between a helictite and a text label---both are rendered as simple dots.
ru_ru: Визуально нет\break никакой разницы между геликтитом и текстовой меткой -- оба они\break отображаются как простые точки.

source: Walls after morphing:
ru_ru: Стены после морфинга:

source: We found no program that was able to draw an up-to-date complex map (i.e. not just survey shots with LRUD envelope), in which the old parts are modified according to the most recent known coordinates of survey stations.
ru_ru: Мы не нашли ни одной программы, которая могла бы нарисовать современную сложную карту (т.е. не только нитку хода с LRUD), в которых старые части съемки изменялись в соответствии с новыми расчетными координатами станций.

source: We had only to glue them together.
ru_ru: Нужно было только сложить их вместе.

source: We knew about programs which were perfectly suited for particular sub-tasks.
ru_ru: Мы знали о программах, которые идеально подходили для конкретных подзадач.

source: We used the output of one of them---TJIKPR---as a background layer with survey stations for hand{-}{-}{-}drawn maps.
ru_ru: Мы использовали вывод одного из них (TJIKPR) в качестве фонового слоя со станциями для ручного рисования карт.

source: We usually insert maps in the last-but-one level in survey hierarchy.Remember that surveys create namespaces, so you may reference only objects in the given survey and all subsurveys.] Each scrap may than contain arbitrary part of any survey in the last level of hierarchy.
ru_ru: Мы обычно вставляем карты в предпоследний уровень в иерархии съемокПомните, что съемки создают пространства имен, поэтому вы можете ссылаться только на объекты в данной съемке и на все подсъемки.]. Каждый скрап может содержать произвольную часть любой съемки на\break последнем уровне иерархии.

source: We usually use one |*.th| file containing centreline per survey trip.
ru_ru: Обычно мы используем один |*.th| файл содержащий нитку хода для каждой отдельной съемки.

source: What we get?.
ru_ru: Что мы получаем?.

source: What will the order of commands in the output file?
ru_ru: Каков порядок команд в выходном файле?

source: When drawing scraps you should check if the outline is properly defined: all lines creating the outer border should have |-outline out| option; all lines surrounding inner pillars |-outline in| option.
ru_ru: При рисовании скрапов вы должны проверить, правильно ли определен контур: все линии создающие внешнюю границу ходов должны иметь опцию |-outline out|; все линии окружающие внутренние колонны опцию |-outline in|.

source: When exporting maps in different projections, you need to select them for each projection separately.
ru_ru: При экспорте карт в разных проекциях вам нужно выбирать их для каждой проекции отдельно.

source: When he states that something is impossible, he is very probably wrong.
ru_ru: Когда он утверждает, что что-то невозможно, он, вероятно,\break ошибается.

source: When importing Survex' 3D file, stations are inserted in survey hierarchy, if there exists identical hierarchy to that in 3D file.
ru_ru: При импорте 3D-файла Survex'а станции вставляются в иерархии съемки, если в 3D-файле существует идентичная иерархия.

source: When joining more than two points or lines, use one join command for all of them, not a sequence of join commands for pairs.E.g. use |join a b c|, not |join a b| followed by |join b c|.]
ru_ru: При объединении более двух точек или линий используйте одну команду `join' для всех из них, а не последовательность командНапример, использовать |join a b c|, а не |join a b|, а затем |join b c|.].

source: When joining scraps, only passage walls are joined.
ru_ru: При соединении скрапов соединяются только ходы.

source: When set to |on| (default), OpenType fonts used in |pdf-fonts| are converted to PFB fonts, if they are PostScript-based.
ru_ru: Когда установлено значение |on| (по умолчанию), шрифты OpenType,\break используемые в |pdf-fonts|, преобразуются в шрифты PFB, если они\break основаны на PostScript.

source: When surveying caves in some large area, you often need to generate an up to date list of all caves in that area.
ru_ru: При съемке пещер на какой-то большой территории вам часто нужно создать список всех пещер на этой территории.

source: When you export map and use
ru_ru: Когда вы экспортируете карту и используете

source: When you export map without defining the symbols in {}, user defined symbols are highlighted in red without any graphical representation.
ru_ru: Когда вы экспортируете карту без определения символов в {}, пользовательские символы выделяются красным цветом без какого-либо графического представления.

source: When you redefine continuation symbol as mentioned above, you can show also continuation codes and descriptions.
ru_ru: Когда вы переопределяете символ продолжения, как указано выше, вы также можете показать коды продолжения и описания.

source: When your system is set-up right the majority of this is hidden from the user and all necessary programs are run automatically by Therion.
ru_ru: Когда ваша система настроена правильно, большинство из файлов скрыто от пользователя, и все необходимые программы\break автоматически запускаются Therion'ом.

source: Which arguments and options are available depends on the particular command.
ru_ru: Какие аргументы и опции доступны, зависит от конкретной команды.

source: While exporting the map, Therion has to determine three attributes for each point, line or area symbol: visibility, clipping and ordering.
ru_ru: При экспорте карты Therion должен определить три атрибута для каждого из символов -- точки, линии или области: видимость, подрезание и\break упорядочение.

source: Why Therion?.
ru_ru: Почему Therion?.

source: Why do we use MetaPost?) }} } { Exercise:} Find two substantial reasons, why the map drawn in XTherion can't be identical with Therion output.
ru_ru: Why do we use MetaPost?) }} } { Упражнение:} Найдите две существенные причины, почему карта,\break нарисованная в XTherion, не может быть идентична выходному файлу\break Therion'а.

source: Width of the above text may be adjusted by || dimen register (its default value is set by |legend-width| layout option).
ru_ru: Ширина вышеуказанного текста может быть скорректирована с помощью регистра || (его значение по умолчанию задано опцией\break |legend-width| эскиза).

source: Windows installer includes all required packages with the exception of {ghostscript}.
ru_ru: Установщик для Windows включает все необходимые пакеты, за\break исключением {ghostscript}.

source: Without this redefinition you'll get the standard layout.
ru_ru: Без этого переопределения вы получите стандартный макет.

source: Works like the |encoding| command in data files---specifies character sets.
ru_ru: Работает аналогично команде |encoding| в файлах данных -- задает кодировку символов.

source: Works like |input| command in data files---includes other files.
ru_ru: Работает как команда |input| в файлах данных -- подключает другие файлы.

source: XTherion displays messages from Therion in the lower part of the screen.
ru_ru: XTherion отображает сообщения Therion'а в нижней части экрана.

source: XTherion doesn't do any syntax checking; it only writes drawn objects with their attributes to a text file.
ru_ru: XTherion не выполняет проверку синтаксиса; он только записывает объекты с атрибутами в текстовый файл.

source: XTherion extended to compiler.
ru_ru: XTherion использует компилятор.

source: XTherion is a GUI (Graphical User Interface) for Therion.
ru_ru: XTherion -- графический пользовательский интерфейс для Therion'а.

source: XTherion is also not the only GUI which may be used with Therion.
ru_ru: XTherion также не является единственным графическим интерфейсом, который можно использовать с Therion'ом.\break

source: XTherion is not a truly WYSIWYG editor.
ru_ru: XTherion не является редактором WYSIWYG.

source: XTherion makes it easier to run Therion especially on systems without a command line prompt.
ru_ru: XTherion упрощает запуск Therion'а, особенно в системах без вывода\break командной строки.

source: XTherion works as an advanced text editor, map editor (where maps are drawn fully interactively) and compiler (which runs Therion on the data).
ru_ru: XTherion работает как расширенный\break текстовый редактор, редактор карт (где карты рисуются в полностью\break интерактивном режиме) и компилятор (который запускает Therion).

source: XTherion's text editor offers some interesting features which may help with creating text input files: support for Unicode encoding and ability to open multiple files.File encoding is specified on the first line of the file.
ru_ru: Текстовый редактор XTherion предлагает некоторые интересные функции, которые могут помочь в создании текстовых входных файлов: поддержка кодировки Unicode и возможность открытия нескольких файловКодировка файла указана в первой строке файла.

source: XTherion, text editor designed for Therion (Tcl/Tk).
ru_ru: XTherion -- текстовый редактор, предназначенный для Therion'а (Tcl/Tk).

source: XTherion---compiler.
ru_ru: XTherion -- компилятор.

source: XTherion---map editor.
ru_ru: XTherion -- редактор карт.

source: XTherion---text editor.
ru_ru: XTherion -- текстовый редактор.

source: XVI images may be used in xtherion to draw in-scale maps.
ru_ru: Изображения XVI могут использоваться для\break рисования карт в масштабе.

source: You can also specify custom attributes to the station using |attr| flag followed by attribute name and value.
ru_ru: Вы также можете указать пользовательские атрибуты для станции,\break используя флаг |attr|, за которым следуют имя и значение атрибута.\break

source: You can also specify output |cs| in configuration file.
ru_ru: Вы также можете указать вывод |cs| в конфигурационном файле.

source: You can also specify them using the |-s| command line option (see below).
ru_ru: Вы также можете указать их с помощью опции |-s| командной строки (см. ниже).

source: You can specify grades only for position or only for surveys.
ru_ru: Вы можете указать определения только для позиции или только для съемок.

source: You can specify it through the |-scrap| option.], |dimensions|Use |-value| option to specify passage dimensions above/below centerline plane used while creating 3D model.];
ru_ru: Вы можете указать ее через опцию |-scrap|.] (сечение), |dimensions|Используя опцию |-value| можно указать размеры хода выше/ниже плоскости нитки хода, используемой при создании 3D-модели.] (размеры хода);

source: You can specify several files here; one per line.
ru_ru: Здесь вы можете указать несколько файлов; по одной в каждой строке.

source: You can specify |cs| option in |centreline|, |surface|, |import| and |layout| objects and then enter XY data in given system.
ru_ru: Вы можете указать опцию |cs| в объектах |centreline|, |surface|, |import| и |layout| и ввести XY в выбранной системе координат.

source: You can test presence of such a variable using |if known ATTR_<name>: ... fi|.
ru_ru: Вы можете проверить наличие такой переменной, используя:\break |if known ATTR_<имя>: ... fi|.

source: You cannot specify this option for the following symbols: station, station-name, label, remark, date, altitude, height, passage-height.
ru_ru: Вы не можете указать этот параметр для следующих символов: station (станция), station-name (имя станции, номер пикета), label (текстовая метка), remark (заметка), date (дата наблюдения), altitude (высотная отметка), height\break (высота уступа/камина/колодца), passage-height (высота хода).

source: You don't have to specify (draw) them with the |point station| command.
ru_ru: Вам не нужно указывать (рисовать) их с помощью\break команды |point station|.

source: You get files |vpalatino.vf|, |vpalatino.tfm| and |palatino.tfm|.
ru_ru: Вы получите файлы |vpalatino.vf|, |vpalatino.tfm| и |palatino.tfm|.

source: You have to drag them to points with known coordinates---usually intersections of mm grid lines on the scanned drawing.
ru_ru: Вы должны перетащить их в точки с известными координатами -- обычно пересечения линий сетки на миллиметровке на отсканированном чертеже.

source: You just use |u:bat| as a type (bat is in fact subtype) of u type.
ru_ru: Вы просто используете |u:bat| как тип (bat -- фактически подтип типа u).

source: You may also export a list of all continuations from your project project using
ru_ru: Вы также можете экспортировать список всех продолжений из своего\break проекта, используя

source: You may associate text description, explored length (behind this continuation) or any other atribute to it (like Code if you have your own coding standard for continuations).
ru_ru: Вы можете связать текстовое описание, исследуемую длину (хода за этим знаком) или любой другой атрибут\break (например, Code, если у вас есть собственный стандарт кодирования для продолжения).

source: You may choose which of the predefined elements to use.
ru_ru: Вы можете выбрать, какой из предопределенных элементов использовать.

source: You may create these files in an arbitrary plain text editor like { ed} or { vi}.
ru_ru: Вы можете создавать эти файлы в любом текстовом редакторе, например\break { ed} или { vi}.

source: You may fill them in three ways:
ru_ru: Вы можете заполнить их тремя способами:

source: You may find more details in the chapter { 6.3.1.5 Encoding file format} in the documentation to Dvips program.
ru_ru: Вы можете найти более подробную информацию в главе { 6.3.1.5 Формат файла кодировки} в документации к программе Dvips.

source: You may redefine continuation symbol to show also continuation description (stored in |_text| attribute) using following layout code
ru_ru: Вы можете переопределить символ продолжения, чтобы показать также\break описание продолжения (сохраненное в атрибуте |_text|), используя следующий код в layout
